#+TITLE: Emacs Configuration
#+AUTHOR:Shayan Azmoodeh
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :results none

**** Mixed Pitch
=mixed-pitch-mode= allows using both fixed pitch and variable pitch fonts in org mode. It automatically changes the fonts so tables and source code blocks use the fixed-pitch font while all other text uses the variable pitch font. I enable mixed pitch mode in all text modes.

#+begin_src emacs-lisp
  (use-package mixed-pitch
    :hook
    ;; If you want it in all text modes:
    (text-mode . mixed-pitch-mode))
#+end_src

#+RESULTS:
| mixed-pitch-mode | text-mode-hook-identify |

